arieselectronicslab/motioncontrollers/schmidt_dspic30f4011_focus.X/schmidt_dspic30f4011_focus.c
/* 
 * File:   schmidt_dspic30f4011_focus.c
 * Author: mr_ts
 *
 * Created on 14 November, 2021, 8:17 PM
 */
// DSPIC30F4011 Configuration Bit Settings

// 'C' source line config statements

// FOSC
#pragma config FPR = HS                 // Primary Oscillator Mode (HS)
#pragma config FOS = PRI                // Oscillator Source (Primary Oscillator)
#pragma config FCKSMEN = CSW_FSCM_OFF   // Clock Switching and Monitor (Sw Disabled, Mon Disabled)

// FWDT
#pragma config FWPSB = WDTPSB_16        // WDT Prescaler B (1:16)
#pragma config FWPSA = WDTPSA_512       // WDT Prescaler A (1:512)
#pragma config WDT = WDT_OFF            // Watchdog Timer (Disabled)

// FBORPOR
#pragma config FPWRT = PWRT_64          // POR Timer Value (64ms)
#pragma config BODENV = BORV20          // Brown Out Voltage (Reserved)
#pragma config BOREN = PBOR_OFF         // PBOR Enable (Disabled)
#pragma config LPOL = PWMxL_ACT_HI      // Low-side PWM Output Polarity (Active High)
#pragma config HPOL = PWMxH_ACT_HI      // High-side PWM Output Polarity (Active High)
#pragma config PWMPIN = RST_IOPIN       // PWM Output Pin Reset (Control with PORT/TRIS regs)
#pragma config MCLRE = MCLR_EN          // Master Clear Enable (Enabled)

// FGS
#pragma config GWRP = GWRP_OFF          // General Code Segment Write Protect (Disabled)
#pragma config GCP = CODE_PROT_OFF      // General Segment Code Protection (Disabled)

// FICD
#pragma config ICS = ICS_PGD            // Comm Channel Select (Use PGC/EMUC and PGD/EMUD)
//#pragma config ICS = ICS_PGD1           // Comm Channel Select (Use EMUC1 and EMUD1)
// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>
#include <string.h>
#include <libpic30.h>
#include <stdio.h>
#include <stdlib.h>
#include <math.h>

#define FCY 2500000ULL //Fcy = (Fosc/4) Fosc = 10MHz



//-------------- 10kHz---------------------------
//PTPER settings
//T_pwm = (PTPER+1)*prescaler/FOSC_4
//ex. T_pwm = (249+1)/2500000 = 0.1 ms or F_osc = 10 kHz
//PDC settings
//14 bit duty cycle register; last 2 bits are for selecting Q1, Q2, Q3, Q4 duty cycle match time
// for Q3 rising edge select last two bits as 10; useful for having 50% duty cycle when time period is odd
// and divide by 2 is not an integer
// Duty cycle 0 and 1 registers 249*2 = 498 in decimal or 0x01f2 in hex
#define STEP_MODE3_OUT      OVDCONbits.POUT1L
#define DIRECTION_MODE4_OUT OVDCONbits.POUT1H 
#define MODE1_OUT           OVDCONbits.POUT2L 
#define MODE2_OUT           OVDCONbits.POUT2H 
#define NOT_ENABLE_OUT      OVDCONbits.POUT3L 
#define NOT_STANDBY_OUT     OVDCONbits.POUT3H 

#define pwm_10kHz   {PTPER = 249 ;\
                    PDC1 = 249 ;}        
                    

//2499 or 0x09C3
#define pwm_1kHz   {PTPER = 2499 ;\  
                    PDC1 = 2499;}
                                

                    
//Stepper motor controller
#define step_cw {OVDCONbits.POVD1L = 1;\
                 DIRECTION_MODE4_OUT=1;\
                 IFS2bits.PWMIF = 0 ;\
                 PTCONbits.PTEN = 1 ;\           
                 while(!IFS2bits.PWMIF);}

#define step_ccw {OVDCONbits.POVD1L = 1;\ 
                 DIRECTION_MODE4_OUT=0;\
                 IFS2bits.PWMIF = 0 ;\
                 PTCONbits.PTEN = 1 ;\          
                 while(!IFS2bits.PWMIF);}



#define FULL_STEP_MODE { NOT_STANDBY_OUT=0;\
                        OVDCONbits.POVD1L = 0;\
                        MODE1_OUT           =0 ;\
                        MODE2_OUT           =0 ;\
                        STEP_MODE3_OUT      =0 ;\
                        DIRECTION_MODE4_OUT =0 ;\
                        NOT_STANDBY_OUT=1;}
                 
#define HALF_STEP_MODE { NOT_STANDBY_OUT=0;\
                        OVDCONbits.POVD1L = 0;\
                        MODE1_OUT=1;\
                        MODE2_OUT=0;\
                        STEP_MODE3_OUT = 1 ;\
                        DIRECTION_MODE4_OUT = 0 ;\
                        NOT_STANDBY_OUT=1;}

#define QTR_STEP_MODE { NOT_STANDBY_OUT=0;\
                        MODE1_OUT=0;\
                        MODE2_OUT=1;\
                        OVDCONbits.POVD1L = 0;\
                        STEP_MODE3_OUT = 0 ;\
                        DIRECTION_MODE4_OUT = 1 ;\
                        NOT_STANDBY_OUT=1;}

#define ONEBYEIGHT_STEP_MODE { NOT_STANDBY_OUT=0;\
                        MODE1_OUT=1;\
                        MODE2_OUT=1;\
                        OVDCONbits.POVD1L = 0;\
                        STEP_MODE3_OUT = 1 ;\
                        DIRECTION_MODE4_OUT = 0 ;\
                        NOT_STANDBY_OUT=1;}                 

#define ONEBY16_STEP_MODE { NOT_STANDBY_OUT=0;\
                        MODE1_OUT=1;\
                        MODE2_OUT=1;\
                        OVDCONbits.POVD1L = 0;\
                        STEP_MODE3_OUT = 1;\
                        DIRECTION_MODE4_OUT = 1 ;\
                        NOT_STANDBY_OUT=1;}                 
/*
 * 
 */

#define ASCII 'A' 
#define BINARY 'B'
#define COMMAND 'C'
#define STATUS 'S'
#define MOVE 'M'
#define STOP 'S'
#define ENABLE 'E'
#define DISABLE 'D'
#define PARAMETER 'P'
        
//ERROR AND WARNING CODES                 
#define  DRIVE_DISABLED  1             
#define  LIMIT_ERROR     2
                 

#define limit_pos PORTDbits.RD0
#define limit_neg PORTDbits.RD2
#define limit_home PORTDbits.RD1
                 
                 
void init(void);
void rs232_init(void) ;
void can_init(void);
void i2c_init(void);
void setint(void) ;
void adc_init(void);
void adc_sample(void);
void encoder_init(void);
void pwm_init(void);
void bin_io_1(unsigned char*, unsigned char);
void bin_io_2(unsigned char*, unsigned char);
void __attribute__((__interrupt__, __auto_psv__)) _T1Interrupt(void);
void __attribute__((__interrupt__, __auto_psv__)) _T2Interrupt(void);
void __attribute__((__interrupt__, __auto_psv__)) _T4Interrupt(void);

