arieselectronicslab/motioncontrollers/schmidt_dspic30f4011_focus.X/schmidt_dspic30f4011_focus.c
void __attribute__((__interrupt__, __auto_psv__)) _U1RXInterrupt(void);
void __attribute__((__interrupt__, __auto_psv__)) _U2RXInterrupt(void);

void __attribute__((__interrupt__, __auto_psv__)) _PWMInterrupt(void);


//--------------------------------------------------------------------------------------------------------------------

//-global variables

//ADC buffer--------
unsigned int adc_1_value, adc_2_value;
float voltage_adc_2;
unsigned char adc_2_value_h,adc_2_value_m,adc_2_value_l,adc_2_value_f;
unsigned char voltage_adc_2_h,voltage_adc_2_m,voltage_adc_2_l,voltage_adc_2_f1,voltage_adc_2_f2,voltage_adc_2_f3;
//------------------

//UART_buffers------
unsigned char tx_1_data[100], tx_1_count,tx_2_data[100], tx_2_count;
unsigned char rx_1_data[100],rec_1_count,rx_2_data[100],rec_2_count;
unsigned char rec1_count, rec2_count ;

//------------------

unsigned int timer_1_counter = 0 ;
unsigned char timer_2_counter = 0 ;
unsigned char timer_3_counter = 0 ;
unsigned char timer_4_counter = 0 ;

long int_count_t1, int_count_t2, int_count_t4 ; 



  
struct 
{
    long encoder_pos ; 
    char encoder_index;
    long position  ;   // um
    long abs_position  ;
    long position_error ;    
    long abs_position_error  ;
    long steps_to_home ;
    long counts    ;   // steps 
    long command   ;   //set point
    long offset    ;   //offset after homing
    long home_pos  ;   //home position (index pulse after limit)
    long plim_pos  ;   //Positive limit position
    long nlim_pos  ;   //Negative limit position
    long soft_plim;     //software positive limit < plim_pos
    long soft_nlim;     //software negative limit > nlim_pos
    unsigned long steps_per_output_motion;  //user defined one unit of output movement. ex. one rotation or 1 mm linear motion
    unsigned int steps_per_motor_rot;   //steps per motor rotation
    unsigned long speed;         // steps/sec
    unsigned long speed_preset; 
    unsigned int reduction;     //motor:output generally = or > 1
    unsigned int device_address;//Device address suffixed in messages
    
    unsigned char error_code;
    
    union
    {
        unsigned int status1;
        struct
        {
            unsigned enable:1;
            unsigned emergency:1;
            unsigned direction:1;
            unsigned plim:1;
            unsigned nlim:1;
            unsigned sw_plim:1;
            unsigned sw_nlim:1;
            unsigned up_down_test:1;
            
            unsigned ok_to_move_pos:1;
            unsigned ok_to_move_neg:1;
            unsigned maint_mode:1;
            unsigned expert:1;
            unsigned homing:1;
            unsigned moving:1 ;
            unsigned homing_completed:1 ;
            unsigned move_done:1;
            
        };
    };
    
    union
    {
        unsigned int status2;
        struct
        {
            unsigned error:1;
            unsigned index_error:1;
            unsigned plim_error:1;
            unsigned nlim_error:1;
            unsigned move_nlim:1;
            unsigned move_plim:1;
            unsigned move_command:1;
            unsigned stop_command:1;
            
            unsigned clockwise_is_positive:1;
            unsigned use_limit:1;
            unsigned use_index_neg:1;   //index after homing
            unsigned use_index_pos:1;   //index after homing
            unsigned home_direction:1;  //homing direction
            unsigned manual_command:1;
            unsigned warning:1;
            unsigned homing_error:1;
            
        };
    };
        
    union
    {
        unsigned int status3;
        struct
        {
            unsigned overvoltage:1;
            unsigned overcurrent:1;
            unsigned over_temp1:1;
            unsigned over_temp2:1;
            unsigned configured:1;
            unsigned error_ack:1;
            unsigned move_ack:1;
            unsigned start_motion:1;
            
            unsigned incomp_rec1_command:1;
            unsigned bad_rec1_command:1;
            unsigned incomp_rec2_command:1;
            unsigned bad_rec2_command:1;
            unsigned invalid_req_position:1;
            unsigned invalid_req_speed:1;
            unsigned :1;
            unsigned homelim:1;
            
        };
    };
    
    union
    {
        unsigned int status4;
        struct
        {
            unsigned plim_sw:1;
            unsigned nlim_sw:1;
            unsigned home_command:1;
            unsigned tem_sensor1_open:1;
            unsigned tem_sensor2_open:1;
            unsigned tem_sensor1_short:1;
            unsigned tem_sensor2_short:1;
            unsigned :1;
            
            unsigned :1;
            unsigned :1;
            unsigned :1;
            unsigned :1;
            unsigned :1;
            unsigned :1;
            unsigned :1;
            unsigned :1;
            
        };
    };
      
    float motor_tem_sensor1 , motor_tem_sensor2;
    unsigned int RT0_1 ;  // NTC RT0 at T0 ?
    float T0_1; //Kelvin
    float RT_1; //current resistance
    unsigned int B1 ;      // K
    unsigned int R1 ;  //R=10K?

    unsigned int RT0_2  ;
    float T0_2  ; //Kelvin
    float RT_2; //current resistance
    unsigned int B2  ;      // K
    unsigned int R2  ; //R=10K?
    float VDD   ; //Supply voltage

} focus;


int main(int argc, char** argv) 
{

    init();
    rs232_init();
    can_init();
    i2c_init();
    setint();
    adc_init();
    encoder_init();
    pwm_init();

    //PWM mode
    //pwm_1kHz
    //FULL_STEP_MODE
    pwm_1kHz
    HALF_STEP_MODE
    //pwm_1kHz
    //QTR_STEP_MODE
    
    //pwm_10kHz
    //ONEBYEIGHT_STEP_MODE
    
     //pwm_10kHz
     //ONEBY16_STEP_MODE
    
    //Enable Timer
    T1CONbits.TON = 1;
    T2CONbits.TON = 1;
    T4CONbits.TON = 1;
   
    ADCON1bits.ADON=1;  // turn ADC ON
    
    while(1)
    {
        U2STAbits.OERR = 0 ;
        U1STAbits.OERR = 0 ;
    }
    
    return (EXIT_SUCCESS);
}


void init()
{
    focus.steps_to_home = 2000;
    focus.RT0_1 = 10000 ;  // NTC RT0 at T0 ?
    focus.T0_1 = 25+273.15 ; //Kelvin
    focus.B1 = 3977 ;      // K
    focus.R1 =  10000 ; //R=10K?

    focus.RT0_2 = 10000 ;  // NTC RT0 at T0 ?
    focus.T0_2 = 25+273.15 ; //Kelvin
    focus.B2 = 3977 ;      // K
    focus.R2 =  10000 ; //R=10K?
    
    focus.VDD = 5.0  ;  //Supply voltage
    
    //limits
    TRISDbits.TRISD0 = 1; 
    TRISDbits.TRISD1 = 1; 
    TRISDbits.TRISD2 = 1; 
   
     

    //constants
    focus.status1=0;
    focus.status2=0;
    focus.position =0  ;  
    focus.counts = 0;
    focus.position_error = 0 ; 
    focus.command = 0   ;    
    focus.offset = 0    ;    
    focus.home_pos = 0  ;    
    focus.plim_pos = 1250  ;    
    focus.nlim_pos = 0  ;    
    focus.soft_plim = 1200;      
    focus.soft_nlim = 50;      
    focus.steps_per_output_motion = 400; 
    focus.steps_per_motor_rot = 400;   
    focus.speed = 250;          
    focus.reduction = 2;      
    focus.device_address = 0X30; 
    focus.speed_preset = 1000; 
    focus.enable = 1;
    
    tx_1_data[0] = 'N';
    tx_1_data[1] = 'o';
    tx_1_data[2] = 't';
    tx_1_data[3] = ' ';
    tx_1_data[4] = 'C';
    tx_1_data[5] = 'o';
    tx_1_data[6] = 'n';
    tx_1_data[7] = 'f';
    tx_1_data[8] = 'i';
    tx_1_data[9] = 'g';
    tx_1_data[10] = 'u';
    tx_1_data[11] = 'r';
    tx_1_data[12] = 'e';
    tx_1_data[13] = 'd';
    tx_1_data[14] = ' ';
    tx_1_data[15] = '\r';
    tx_1_data[16] = '\n';
    
    
 
    //TxCON: Type A Time Base Register
    //bit 15 TON: Timer On Control bit
    //  1 = Starts the timer
    //  0 = Stops the timer
    T2CONbits.TON = 0;
    //bit 14 Unimplemented: Read as ?0?
    //bit 13 TSIDL: Stop in Idle Mode bit
    //  1 = Discontinue timer operation when device enters Idle mode
    //  0 = Continue timer operation in Idle mode
    T2CONbits.TSIDL = 0 ;
    //bit 12-7 Unimplemented: Read as ?0?
    //bit 6 TGATE: Timer Gated Time Accumulation Enable bit
    //  1 = Gated time accumulation enabled
    //  0 = Gated time accumulation disabled
    //  (TCS must be set to ?0? when TGATE = 1. Reads as ?0? if TCS = 1)
    T2CONbits.TGATE = 0;
    //bit 5-4 TCKPS<1:0>: Timer Input Clock Prescale Select bits
    //  11 = 1:256 prescale value
    //  10 = 1:64 prescale value
    //  01 = 1:8 prescale value
    //  00 = 1:1 prescale value
    T2CONbits.TCKPS = 1 ;
    //bit 3 Unimplemented: Read as ?0?
    //bit 2 TSYNC: Timer External Clock Input Synchronization Select bit
    //When TCS = 1:
    //1 = Synchronize external clock input
    //0 = Do not synchronize external clock input
    //When TCS = 0:
    //This bit is ignored. Read as ?0?. Timer1 uses the internal clock when TCS = 0.
    //bit 1 TCS: Timer Clock Source Select bit
    //1 = External clock from pin TxCK
    //0 = Internal clock (FOSC/4)
    T2CONbits.TCS = 0;

