arieselectronicslab/motioncontrollers/schmidt_dspic30f4011_focus.X/schmidt_dspic30f4011_focus.c
    C1RX0CON=0x0000;
    C1RX1CON =0;
    
    
    
    //CiCFG1: Baud Rate Configuration Register 1
    //bit 15-8 Unimplemented: Read as ?0?
    //bit 7-6 SJW<1:0>: Synchronized Jump Width bits
        //11 = Synchronized jump width time is 4 x TQ
        //10 = Synchronized jump width time is 3 x TQ
        //01 = Synchronized jump width time is 2 x TQ
        //00 = Synchronized jump width time is 1 x TQ
    //bit 5-0 BRP<5:0>: Baud Rate Prescaler bits
        //11 1111 = TQ = 2 x (BRP + 1)/FCAN = 128/FCAN
        //11 1110 = TQ = 2 x (BRP + 1)/FCAN = 126/FCAN
        //.
        //00 0001 = TQ = 2 x (BRP + 1)/FCAN = 4/FCAN
        //00 0000 = TQ = 2 x (BRP + 1)/FCAN = 2/FCAN
    //Note: FCAN is FCY or 4 FCY, depending on the CANCKS bit setting.
    C1CFG1bits.BRP = 3;
    
    //CiCFG2: Baud Rate Configuration Register 2
    //bit 15 Unimplemented: Read as ?0?
    //bit 14 WAKFIL: Select CAN bus Line Filter for Wake-up bit
        //1 = Use CAN bus line filter for wake-up
        //0 = CAN bus line filter is not used for wake-up
    //bit 13-11 Unimplemented: Read as ?0?
    //bit 10-8 SEG2PH<2:0>: Phase Buffer Segment 2 bits
        //111 = length is 8 x TQ
        //.
        //000 = length is 1 x TQ
    //bit 7 SEG2PHTS: Phase Segment 2 Time Select bit
        //1 = Freely programmable
        //0 = Maximum of SEG1PH or information processing time (3 TQ?s), whichever is greater
    //bit 6 SAM: Sample of the CAN bus Line bit
        //1 = Bus line is sampled three times at the sample point
        //0 = Bus line is sampled once at the sample point
    //bit 5-3 SEG1PH<2:0>: Phase Buffer Segment 1 bits
        //111 = length is 8 x TQ
        //.
        //000 = length is 1 x TQ
    //bit 2-0 PRSEG<2:0>: Propagation Time Segment bits
        //111 = length is 8 x TQ
        //.
        //000 = length is 1 x TQ
    C1CFG2 = 0x0018;
    
    C1CTRLbits.REQOP = 0;
    while(C1CTRLbits.OPMODE !=0);
    
}


void    i2c_init()
{
}

void    setint()
{

    INTCON1bits.NSTDIS = 0;

    //reserved 0x7
    IPC5bits.T4IP = 0x6;    //safety
    //can receive 5
    IPC2bits.U1RXIP = 0x04; //serial 4
    IPC6bits.U2RXIP = 0x04; //serial 4
    IPC9bits.PWMIP = 0X03;
    IPC0bits.T1IP = 0x1;    //control
    //reserved 0x2
    IPC1bits.T2IP = 0x2;    //send
     
    IEC0bits.T1IE = 1 ;
    IFS0bits.T1IF = 0;

    IEC0bits.T2IE = 1 ;
    IFS0bits.T2IF = 0;
    
    //disabled
    IEC0bits.T3IE = 0 ;
    IFS0bits.T3IF = 0;

    IEC1bits.T4IE = 1 ;
    IFS1bits.T4IF = 0;

    IEC2bits.PWMIE = 0; 
    IFS2bits.PWMIF = 0;
    
    IEC0bits.U1RXIE = 1;
    IFS0bits.U1RXIF = 0 ;

    IEC1bits.U2RXIE = 1;
    IFS1bits.U2RXIF = 0 ;
  

    IFS0bits.U1TXIF = 0 ;
    
   
}
void  adc_init()
{
    TRISBbits.TRISB2 = 1 ;  //AN2/RB2 pin input     //T sensor 
    TRISBbits.TRISB6 = 1 ;  //AN2/RB6 pin input     //T sensor 

    //ADCON1: A/D Control Register 1
    //bit 15 ADON: A/D Operating Mode bit
    //  1 = A/D converter module is operating
    //  0 = A/D converter is off
    ADCON1bits.ADON=0;
    //bit 14 Unimplemented: Read as ?0?
    //bit 13 ADSIDL: Stop in Idle Mode bit
    //  1 = Discontinue module operation when device enters Idle mode
    //  0 = Continue module operation in Idle mode
    ADCON1bits.ADSIDL = 0;
    //bit 12-10 Unimplemented: Read as ?0?
    //bit 9-8 FORM<1:0>: Data Output Format bits
    //  11 = Signed fractional (DOUT = sddd dddd dddd 0000)
    //  10 = Fractional (DOUT = dddd dddd dddd 0000)
    //  01 = Signed integer (DOUT = ssss sddd dddd dddd)
    //  00 = Integer (DOUT = 0000 dddd dddd dddd)
    ADCON1bits.FORM = 0 ;
    //bit 7-5 SSRC<2:0>: Conversion Trigger Source Select bits
    //    111 = Internal counter ends sampling and starts conversion (auto convert)
    //    110 = Reserved
    //    101 = Reserved
    //    100 = Reserved
    //    011 = Motor Control PWM interval ends sampling and starts conversion
    //    010 = General purpose Timer3 compare ends sampling and starts conversion
    //    001 = Active transition on INT0 pin ends sampling and starts conversion
    //    000 = Clearing SAMP bit ends sampling and starts conversion
    ADCON1bits.SSRC=7;
    //bit 4-3 Unimplemented: Read as ?0?
    //bit 2 ASAM: A/D Sample Auto-Start bit
    //    1 = Sampling begins immediately after last conversion completes. SAMP bit is auto set.
    //    0 = Sampling begins when SAMP bit set
    ADCON1bits.ASAM = 1;
    //bit 1 SAMP: A/D Sample Enable bit
    //    1 = At least one A/D sample/hold amplifier is sampling
    //    0 = A/D sample/hold amplifiers are holding
    //    When ASAM = 0, writing ?1? to this bit will start sampling.
    //    When SSRC = 000, writing ?0? to this bit will end sampling and start conversion.
    ADCON1bits.SAMP = 0 ;
    //bit 0 DONE: A/D Conversion Status bit
    //    1 = A/D conversion is done
    //    0 = A/D conversion is not done
    //    Clearing this bit will not effect any operation in progress.
    //    Cleared by software or start of a new conversion.

    //ADCON2: A/D Control Register 2
    //bit 15-13 VCFG<2:0>: Voltage Reference Configuration bits
    //000 AVDD AVSS
    //001 External VREF+ pin AVSS
    //010 AVDD External VREF- pin
    //011 External VREF+ pin External VREF- pin
    //1xx AVDD AVSS
    ADCON2bits.VCFG = 0;
    //bit 12 Reserved: User should write ?0? to this location
    //bit 11 Unimplemented: Read as ?0?
   
     //bit 10 CSCNA: Scan Input Selections for CH0+ S/H Input for MUX A Input Multiplexer Setting bit
    //1 = Scan inputs
    //0 = Do not scan inputs
   ADCON2bits.CSCNA = 1;

   
    ADCON2bits.CHPS = 0; 
   
    //bit 5-2 SMPI<3:0>: Sample/Convert Sequences Per Interrupt Selection bits
    //1111 = Interrupts at the completion of conversion for each 16th sample/convert sequence
    //1110 = Interrupts at the completion of conversion for each 15th sample/convert sequence
    //.....
    //0001 = Interrupts at the completion of conversion for each 2nd sample/convert sequence
    //0000 = Interrupts at the completion of conversion for each sample/convert sequence
    
   
