arieselectronicslab/motioncontrollers/schmidt_dspic30f4011_focus.X/schmidt_dspic30f4011_focus.c
   ADCON2bits.SMPI = 2;
    
    //bit 9-8 Unimplemented: Read as ?0?
    //bit 7 BUFS: Buffer Fill Status bit
    //Only valid when BUFM = 1 (ADRES split into 2 x 8-word buffers)
    //1 = A/D is currently filling buffer 0x8-0xF, user should access data in 0x0-0x7
    //0 = A/D is currently filling buffer 0x0-0x7, user should access data in 0x8-0xF
    //bit 6 Unimplemented: Read as ?0?
    //bit 1 BUFM: Buffer Mode Select bit
    //1 = Buffer configured as two 8-word buffers ADCBUF(15...8), ADCBUF(7...0)
    //0 = Buffer configured as one 16-word buffer ADCBUF(15...0)
    ADCON2bits.BUFM = 0;
    //bit 0 ALTS: Alternate Input Sample Mode Select bit
    //1 = Uses MUX A input multiplexer settings for first sample, then alternate between MUX B and MUX A input
    //multiplexer settings for all subsequent samples
    //0 = Always use MUX A input multiplexer settings
     ADCON2bits.ALTS = 0;

    //ADCON3: A/D Control Register 3
    //bit 15-13 Unimplemented: Read as ?0?
    //bit 12-8 SAMC<4:0>: Auto Sample Time bits
    //11111 = 31 TAD
    //·····
    //00001 = 1 TAD
    //00000 = 0 TAD
    ADCON3bits.SAMC = 14;   //1 TAD per bit + 1 TAD use 14 TAD for 12 bits
    //bit 7 ADRC: A/D Conversion Clock Source bit
    //1 = A/D internal RC clock
    //0 = Clock derived from system clock
    ADCON3bits.ADRC =  0; 
    //bit 6 Unimplemented: Read as ?0?
    //bit 5-0 ADCS<5:0>: A/D Conversion Clock Select bits
    //111111 = TCY/2 * (ADCS<5:0> + 1) = 32 ? TCY
    //······
    //000001 = TCY/2 ? (ADCS<5:0> + 1) = TCY
    //000000 = TCY/2 ? (ADCS<5:0> + 1) = TCY/2
    ADCON3bits.ADCS = 4 ; //TAD =TCY(ADCS + 1)/2  ; minimum TAD time of 333.33 nsec ; use 1 us
                          // for 1 us ADCS = 4, therefore TAD = .4us*5/2 = 1 us
    //ADCHS: A/D Input Select Register
    ADCHS = 0;
    ADCHSbits.CH0SA = 2;
    //ADPCFG: A/D Port Configuration Register
    //bit 15-0 PCFG<15:0>: Analog Input Pin Configuration Control bits
    //  1 = Analog input pin in Digital mode, port read input enabled, A/D input multiplexer input connected to AVSS
    //  0 = Analog input pin in Analog mode, port read input disabled, A/D samples pin voltage
    ADPCFGbits.PCFG0 = 1 ;
    ADPCFGbits.PCFG1 = 1 ;
    ADPCFGbits.PCFG2 = 0 ;
    ADPCFGbits.PCFG3 = 1 ;
    ADPCFGbits.PCFG4 = 1 ;
    ADPCFGbits.PCFG5 = 1 ;
    ADPCFGbits.PCFG6 = 0 ;
    ADPCFGbits.PCFG7 = 1 ;
    ADPCFGbits.PCFG8 = 1 ;
    //ADCSSL: A/D Input Scan Select Register
    //CSSL<15:0>: A/D Input Pin Scan Selection bits
    //1 = Select ANx for input scan
    //0 = Skip ANx for input scan
    ADCSSL = 0 ;
    ADCSSLbits.CSSL0 = 0 ;
    ADCSSLbits.CSSL1 = 0 ;
    ADCSSLbits.CSSL2 = 1 ;
    ADCSSLbits.CSSL3 = 0 ;
    ADCSSLbits.CSSL4 = 0 ;
    ADCSSLbits.CSSL5 = 0 ;
    ADCSSLbits.CSSL6 = 1 ;
    ADCSSLbits.CSSL7 = 0 ;
    ADCSSLbits.CSSL8 = 0 ;
}

void  adc_sample()
{
}

void  bin_io_1(unsigned char *ptr_tx_data, unsigned char local_tx_count)
{
    //UART1
    static char for_count;
    for(for_count=0;for_count<local_tx_count;for_count++)
    {
         U1TXREG=  *(ptr_tx_data+for_count) ;
         if(!U1STAbits.UTXEN)
         {
             U1STAbits.UTXEN = 1;
         }
         while(!IFS0bits.U1TXIF);
         IFS0bits.U1TXIF= 0;
    }
}

void  bin_io_2(unsigned char *ptr_tx_data, unsigned char local_tx_count)
{
    //UART 2
    static char for_count;
    for(for_count=0;for_count<local_tx_count;for_count++)
    {
        U2TXREG= *(ptr_tx_data+for_count) ;
        while(U2STAbits.UTXBF);
       // while(!IFS1bits.U2TXIF);
       // IFS1bits.U2TXIF= 0;
    }
}

//safety loop
void __attribute__((__interrupt__, __auto_psv__)) _T4Interrupt(void)
{

    IFS1bits.T4IF = 0;
    
    int_count_t4++;
        if(int_count_t4>99999)
            int_count_t4 = 0;
    
    while(!IFS0bits.ADIF);
    adc_1_value = ADCBUF0;     //focus_jog_y
    adc_2_value = ADCBUF1;     //focus_jog_x
    IFS0bits.ADIF = 0 ;
    
    if(adc_1_value>1000)
    {
        focus.tem_sensor1_open = 1;
        adc_1_value = 1000;
    }
    else if(adc_1_value<100)
    {
        focus.tem_sensor1_short = 1;
        adc_1_value = 100;
    }
    else 
    {
        focus.tem_sensor1_open = 0;
        focus.tem_sensor1_short = 0;
    }
    
    if(adc_2_value>1000)
    {
        focus.tem_sensor2_open = 1;
        adc_2_value = 1000;
    }
    else if(adc_2_value<100)
    {
        focus.tem_sensor2_short = 1;
        adc_2_value = 100;
    }
    else 
    {
        focus.tem_sensor2_open = 0;
        focus.tem_sensor2_short = 0;
    }
    
    focus.plim_sw = !(limit_pos) ;
    focus.nlim_sw = !(limit_neg) ;
    focus.homelim = !(limit_home) ;
    
    if(focus.error_ack)
    {
     
        focus.incomp_rec1_command = 0 ; 
        focus.bad_rec1_command = 0 ;
        focus.incomp_rec2_command = 0 ;
        focus.bad_rec2_command = 0 ; 
        focus.invalid_req_position = 0 ; 
        focus.invalid_req_speed = 0 ;
        focus.over_temp1 = 0;
        focus.over_temp2 = 0 ;
        focus.overcurrent = 0;
        focus.overvoltage = 0 ;
        focus.plim_error = 0 ;
        focus.nlim_error = 0 ;
        focus.index_error = 0 ;
        focus.error = 0 ;
        
        focus.warning = 0;
        focus.error_ack = 0;
    }

    if(!focus.homing_completed | !focus.configured | focus.homing_error | focus.index_error| focus.nlim_error| focus.plim_error)
    {
        focus.warning = 1;
    }
    
    if((focus.soft_nlim<=focus.nlim_pos) | (focus.soft_plim>=focus.plim_pos))
    {
        focus.warning = 1;
    }
    
    if(focus.position<=focus.soft_nlim)  
    {
        focus.sw_nlim = 1;
    }
    else
    {
        focus.sw_nlim = 0;
    }
    
    if(focus.position>=focus.soft_plim)  
    {
        focus.sw_plim = 1;
     }
    else
    {
        focus.sw_plim = 0;
    }
    
    if(focus.plim_sw|focus.sw_plim)
    {
        focus.plim = 1 ;
    }
    else 
    {
        focus.plim = 0 ;
    }
    if(focus.nlim_sw|focus.sw_nlim)
    {
        focus.nlim = 1 ;
    }
    else 
    {
        focus.nlim = 0 ;
    }
    
    
    if(focus.enable & !focus.emergency & !focus.error) 
    {
        if(!focus.plim)
            focus.ok_to_move_pos = 1 ; 
        else
            focus.ok_to_move_pos = 0 ;
        
        if(!focus.nlim)
            focus.ok_to_move_neg = 1 ; 
        else
            focus.ok_to_move_neg = 0 ;
                    
