arieselectronicslab/motioncontrollers/schmidt_dspic30f4011_focus.X/schmidt_dspic30f4011_focus.c
    }
    else
    {
         focus.ok_to_move_pos = 0 ;
         focus.ok_to_move_neg = 0 ;
         focus.command = focus.position ;
         focus.error = 0 ;
         focus.stop_command =1;
         focus.move_command = 0;
         focus.moving = 0 ; 
       
    }
}

void __attribute__((__interrupt__, __auto_psv__)) _T1Interrupt(void)
{
    /* The focus mechanism slides on a precise THK Ball Screw arrangement which 
     * travels 5 mm/revolution. 
     * The mechanism is coupled to a Superior Electric KM062 bipolar stepper motor 
     * using a timing belt and pulleys offering a reduction of 1:2. 
     * It has an incremental shaft encoder for position measurement and for initial 
     * referencing a PCA-116 series LVDT is used. 
     * The motor and the on-shaft encoder undergo four full rotations generating 
     * four index pulses in the range ±5 mm. 
     * At 0.9 degree per half step the housing can be positioned with a resolution of 6.25 µm.
     * 400 1/2 steps per one motor rotation
     * 800 1/2 steps per one shaft rotation
     * 800 1/2 steps per 5mm travel
     * Total range -/+ 5 mm. or 1600 steps or 4 rotations.
     * Resolution 5/800 mm = 6.25 um
     */
    static long i; 
    
    IFS0bits.T1IF = 0;
    //timer_1_counter++;
   
    
    
  //  ADCON1bits.SAMP = 1;
   // while(!ADCON1bits.DONE);
    //adc_2_value = ADCBUF0;
    if(focus.home_command&(focus.ok_to_move_pos||focus.ok_to_move_neg))
    {
        if(focus.speed == 0)
            PTPER = 0 ; 
        else 
            PTPER = 1.0*2500000/focus.speed - 1;
        
        PDC1 = PTPER ; 
        
        focus.homing_completed = 0;
        focus.home_command = 0;
        focus.counts = 0;
        focus.homing = 1 ; 
        focus.moving = 1; 
        
        
        if(focus.home_direction)
        {
            while(1)
            {
                if(focus.stop_command || focus.move_command || focus.home_command)
                {
                    break;
                }
                                
                if(focus.plim_sw)
                {
                    focus.plim = 1;
                    
                    focus.position = focus.plim_pos; 
                    focus.command = focus.position;
                    focus.position_error = 0;
                    focus.homing = 0 ; 
                    focus.moving = 0; 
                    focus.homing_completed = 1;
                    break;
                }
                
                if(focus.counts==focus.steps_to_home)
                {
                    focus.homing = 0 ; 
                    focus.moving = 0; 
                    focus.homing_error ;
                    
                    break;
                }
                
                step_cw
                focus.counts++;        
                focus.position++;   
             }
        }
        else
        {
            while(1)
            {
                if(focus.stop_command || focus.move_command || focus.home_command)
                {
                    break;                    
                }
                
                if(focus.nlim_sw)
                {
                    focus.nlim = 1;
                    
                    focus.position = focus.nlim_pos;
                    focus.command = focus.position;
                    focus.position_error = 0;
                    
                     focus.homing = 0 ; 
                     focus.moving = 0; 
       
                            
                    break;
                }
                if(focus.counts==focus.steps_to_home)
                {
                    focus.homing = 0 ; 
                    focus.moving = 0; 
                    focus.homing_error ;
                    
                    break;
                }
                
                step_ccw
                focus.counts++;
                focus.position--;
            }
        }
    }
    
    if(focus.move_command&(focus.ok_to_move_pos||focus.ok_to_move_neg))
    {
        if(focus.speed == 0)
            PTPER = 0 ; 
        else 
            PTPER = 1.0*2500000/focus.speed - 1;
        
        PDC1 = PTPER ; 
        focus.move_command = 0;
        focus.moving = 1 ; 
        
        focus.position_error = focus.command - focus.position;

        if(focus.position_error>=0)
        {    
            focus.direction = 1;
            while((focus.position!=focus.command))
            {
                if(focus.stop_command || focus.move_command || focus.home_command)
                {
                    break;
                }
                                
                if(focus.position >= focus.soft_plim)
                {
                     focus.sw_plim = 1;
                    
                    focus.command = focus.position;
                    focus.position_error = 0;
                    break;
                }
                
                step_cw
                focus.position++;   
                focus.position_error = focus.command - focus.position ; 
                
            }

        }
        else
        {
            focus.direction = 0;
            while((focus.position!=focus.command))
            {
                if(focus.stop_command || focus.move_command || focus.home_command)
                {
                    break;                    
                }
                
                if(focus.position <= focus.soft_nlim)
                {
                    focus.sw_nlim = 1;
                    
                    focus.command = focus.position;
                    focus.position_error = 0;
                            
                    break;
                }
                
                step_ccw
                focus.position--;
                focus.position_error = focus.command - focus.position ; 
                

