arieselectronicslab/motioncontrollers/schmidt_dspic30f4011_focus.X/schmidt_dspic30f4011_focus.c
            }
        }
    
        
        focus.moving = 0 ; 
        focus.move_done = 1;
      
    }
    
    C1TX0DLCbits.DLC = 8;
    C1TX0B1 = 1 ;
    C1TX0B2 = 2 ;
    C1TX0B3 = 3 ;
    C1TX0B4 = 4 ;
    C1TX0CONbits.TXREQ =1;
    
}


void __attribute__((__interrupt__, __auto_psv__)) _T2Interrupt(void)
{

    IFS0bits.T2IF = 0;
    
    int_count_t2++;
        if(int_count_t2>99999)
            int_count_t2 = 0;
        
    timer_2_counter++;
   
    
    
    if(timer_2_counter == 2)    //200 ms timer x 5 = 1000 ms
    {
        //module
        /* Formula 
         * RT_1 = VDD*R1/VADC - R1 
         * VADC = VDD*ADC_counts/1023 
         * therefore RT_1/R1 = 1023/ADC_counts - 1
         * T = 1/(ln(RT/R)+1/T0)-273.15        
        */ 
        //focus.RT_1 = (1023.0/adc_1_value - 1); //ratio of RT1/R1
        focus.motor_tem_sensor1 = 1/(log(1023.0/adc_1_value - 1)/focus.B1 + 1/focus.T0_1)-273.15;
        
        //focus.RT_2 = (1023.0/adc_2_value - 1); //ratio of RT1/R1
        focus.motor_tem_sensor2 = 1/(log(1023.0/adc_2_value - 1)/focus.B2 + 1/focus.T0_2)-273.15;
                
        
        
        tx_1_data[0] = 'B';
        tx_1_data[1] = focus.device_address/10+48;
        tx_1_data[2] = focus.device_address%10+48;
        tx_1_data[3] = ',';
        
        focus.abs_position = abs(focus.position) ;
        focus.abs_position_error = abs(focus.position_error);
        
        if(focus.position<0)
            tx_1_data[4] = '-';
        else 
            tx_1_data[4] = '+';
        
        
        tx_1_data[5] =  (focus.abs_position)/10000%10+48;
        tx_1_data[6] =  (focus.abs_position)/1000%10+48;
        tx_1_data[7] =  (focus.abs_position)/100%10+48;
        tx_1_data[8] =  (focus.abs_position)/10%10+48;
        tx_1_data[9] =  (focus.abs_position)%10+48;
        tx_1_data[10] =  ',';
        tx_1_data[11] =  (focus.abs_position_error)/10000%10+48;
        tx_1_data[12] =  (focus.abs_position_error)/1000%10+48;
        tx_1_data[13] =  (focus.abs_position_error)/100%10+48;
        tx_1_data[14] =  (focus.abs_position_error)/10%10+48;
        tx_1_data[15] =  (focus.abs_position_error)%10+48;
        tx_1_data[16] =  ','; 
        tx_1_data[17] =  (POSCNT)/10000%10+48;
        tx_1_data[18] =  (POSCNT)/1000%10+48;
        tx_1_data[19] =  (POSCNT)/100%10+48;
        tx_1_data[20] =  (POSCNT)/10%10+48;
        tx_1_data[21] =  (POSCNT)%10+48;
        tx_1_data[22] =  ',';
        if(focus.motor_tem_sensor1<0)
            tx_1_data[23] = '-';
        else 
            tx_1_data[23] = '+';    
        tx_1_data[24] =  (int)abs(focus.motor_tem_sensor1)/100%10+48;
        tx_1_data[25] =  (int)abs(focus.motor_tem_sensor1)/10%10+48;
        tx_1_data[26] =  (int)abs(focus.motor_tem_sensor1)%10+48;
        tx_1_data[27] =  '.'; 
        tx_1_data[28] =  (int)abs(focus.motor_tem_sensor1*10)%10+48;
        tx_1_data[29] =  ',';
        if(focus.motor_tem_sensor2<0)
            tx_1_data[30] = '-';
        else 
            tx_1_data[30] = '+';    
        
        tx_1_data[31] =  (int)abs(focus.motor_tem_sensor2)/100%10+48;
        tx_1_data[32] =  (int)abs(focus.motor_tem_sensor2)/10%10+48;
        tx_1_data[33] =  (int)abs(focus.motor_tem_sensor2)%10+48;
        tx_1_data[34] =  '.'; 
        tx_1_data[35] =  (int)abs(focus.motor_tem_sensor2*10)%10+48;
        tx_1_data[36] =  ','; 
        
        if(focus.soft_nlim<0)
            tx_1_data[37] =  '-';
        else 
            tx_1_data[37] =  '+';
        /*tx_1_data[38] =  adc_1_value/10000%10+48;//abs(focus.soft_nlim)/10000%10+48;
        tx_1_data[39] =  adc_1_value/1000%10+48;//abs(focus.soft_nlim)/1000%10+48;
        tx_1_data[40] =  adc_1_value/100%10+48;//abs(focus.soft_nlim)/100%10+48;
        tx_1_data[41] =  adc_1_value/10%10+48;//abs(focus.soft_nlim)/10%10+48;
        tx_1_data[42] =  adc_1_value%10+48;//abs(focus.soft_nlim)%10+48;
        tx_1_data[43] =  ',';
        */
        tx_1_data[38] =  abs(focus.soft_nlim)/10000%10+48;
        tx_1_data[39] =  abs(focus.soft_nlim)/1000%10+48;
        tx_1_data[40] =  abs(focus.soft_nlim)/100%10+48;
        tx_1_data[41] =  abs(focus.soft_nlim)/10%10+48;
        tx_1_data[42] =  abs(focus.soft_nlim)%10+48;
        tx_1_data[43] =  ',';
         if(focus.soft_plim<0)
            tx_1_data[44] =  '-';
        else 
            tx_1_data[44] =  '+';
        /*tx_1_data[45] =  adc_2_value/10000%10+48;//abs(focus.soft_plim)/10000%10+48;
        tx_1_data[46] =  adc_2_value/1000%10+48;//abs(focus.soft_plim)/1000%10+48;
        tx_1_data[47] = adc_2_value/100%10+48;// abs(focus.soft_plim)/100%10+48;
        tx_1_data[48] = adc_2_value/10%10+48;// abs(focus.soft_plim)/10%10+48;
        tx_1_data[49] =  adc_2_value%10+48;//abs(focus.soft_plim)%10+48;
        tx_1_data[50] =  ',';
        */
        tx_1_data[45] =  abs(focus.soft_plim)/10000%10+48;
        tx_1_data[46] =  abs(focus.soft_plim)/1000%10+48;
        tx_1_data[47] = abs(focus.soft_plim)/100%10+48;
        tx_1_data[48] = abs(focus.soft_plim)/10%10+48;
        tx_1_data[49] =  abs(focus.soft_plim)%10+48;
        tx_1_data[50] =  ',';
                
        tx_1_data[51] =  focus.status1>>8;
        tx_1_data[52] =  focus.status1;
        tx_1_data[53] =  focus.status2>>8;
        tx_1_data[54] =  focus.status2;
        tx_1_data[55] =  focus.status3>>8;
        tx_1_data[56] =  focus.status3;
        tx_1_data[57] =  focus.status4>>8;
        tx_1_data[58] =  focus.status4;
       
        tx_1_data[59] =  '\n';
        tx_1_data[60] =  '\r';


        tx_1_count  =  61;
        tx_2_count  =  61;


        bin_io_1(tx_1_data,tx_1_count);   
        
        //rs232
        //bin_io_2(tx_1_data,tx_2_count);
        timer_2_counter =0 ; 
    }
    
     
}



void __attribute__((__interrupt__, __auto_psv__)) _U2RXInterrupt(void)
{
    IFS1bits.U2RXIF = 0 ;
    while(!U2STAbits.URXDA);
    rx_2_data[0]= U2RXREG;
    if(rx_2_data[0]=='R')
    {
        while(1);
    }
     
    IFS1bits.U2RXIF = 0 ;
} 

void __attribute__((__interrupt__, __auto_psv__)) _U1RXInterrupt(void)
{
    static char i ; 

