arieselectronicslab/motioncontrollers/schmidt_dspic30f4011_focus.X/schmidt_dspic30f4011_focus.c
    for (i=0;i<25;i++)
        rx_1_data[i] = '0';
            
    IFS0bits.U1RXIF = 0 ;
    rx_1_data[0]= U1RXREG;
    
           
    if(rx_1_data[0]=='B')
    {
        
        T3CONbits.TON=0;
        TMR3=0;
        IFS0bits.T3IF = 0 ;
        T3CONbits.TON=1;
        while(!U1STAbits.URXDA)
        {
              
            if(IFS0bits.T3IF)
            {
                T3CONbits.TON =0;
                focus.incomp_rec1_command = 1; 
                return;
                
            }
        }
        
        IFS0bits.U1RXIF = 0 ;
        rx_1_data[1]= U1RXREG-48;
        
       
        for(rec1_count=0;rec1_count<rx_1_data[1];rec1_count++)
        {
            T3CONbits.TON=0;
            TMR3=0;
            IFS0bits.T3IF = 0 ;
            T3CONbits.TON=1;
            while(!U1STAbits.URXDA)
            {
                if(IFS0bits.T3IF)
                {
                    T3CONbits.TON =0;
                    focus.incomp_rec1_command = 1; 
                    return;
                }
            }
            
            IFS0bits.U1RXIF = 0 ;
            rx_1_data[rec1_count+2] = U1RXREG;
        }
        
        T3CONbits.TON=0;
            
        switch(rx_1_data[2])
        {
            case COMMAND:   
                            { 
                                if(rx_1_data[3]== 'H')
                                {
                                    focus.stop_command = 0; 
                                    focus.home_command = 1;
                                    focus.speed = focus.speed_preset;
                                    
                                }
                                
                                if(rx_1_data[3]== 'V'||rx_1_data[3]== 'v')
                                {
                                   if((rx_1_data[4]>= '0'&& rx_1_data[4]<= '9')&(rx_1_data[5]>= '0'&& rx_1_data[5]<= '9')&(rx_1_data[6]>= '0'&& rx_1_data[6]<= '9')&(rx_1_data[7]>= '0'&& rx_1_data[7]<= '9')&(rx_1_data[8]>= '0'&& rx_1_data[8]<= '9'))
                                    {
                                        focus.speed = (rx_1_data[4]-48)*10000+(rx_1_data[5]-48)*1000+(rx_1_data[6]-48)*100+(rx_1_data[7]-48)*10+rx_1_data[8]-48;
                                        
                                        
                                        if(!focus.speed)
                                        {
                                            focus.command = focus.position ; 
                                            focus.move_command = 1;
                                            focus.speed = focus.speed_preset;
                                        }
                                        else 
                                        {
                                            focus.command = 99999;
                                            if(rx_1_data[3]== 'v')
                                                focus.command = -1*focus.command;
                                        
                                            focus.stop_command = 0; 
                                            focus.move_command = 1;
                                        }
                                        
                                       
                                    }
                                    else 
                                    {
                                        focus.invalid_req_position = 1; 
                                        return;
                                    } 
                                     
                                }
                                if(rx_1_data[3]== 'S')
                                {
                                    //focus.stop_command = 1; 
                                    focus.command = focus.position ; 
                                    focus.move_command = 1;
                                    focus.speed = focus.speed_preset;
                                   
                                }
                                if(rx_1_data[3]== '-' || rx_1_data[3]== '+')
                                {   
                                    if((rx_1_data[4]>= '0'&& rx_1_data[4]<= '9')&(rx_1_data[5]>= '0'&& rx_1_data[5]<= '9')&(rx_1_data[6]>= '0'&& rx_1_data[6]<= '9')&(rx_1_data[7]>= '0'&& rx_1_data[7]<= '9')&(rx_1_data[8]>= '0'&& rx_1_data[8]<= '9'))
                                    {
                                        focus.command = (rx_1_data[4]-48)*10000+(rx_1_data[5]-48)*1000+(rx_1_data[6]-48)*100+(rx_1_data[7]-48)*10+rx_1_data[8]-48;
                                        if(rx_1_data[3]== '-')
                                            focus.command = -1*focus.command;
                                        focus.stop_command = 0; 
                                        focus.move_command = 1;
                                        focus.speed = focus.speed_preset;
                                    }
                                    else 
                                    {
                                        focus.invalid_req_position = 1; 
                                        return;
                                    }
                                    
                                }
                                if(rx_1_data[3]== 'P' || rx_1_data[3]== 'N')
                                {                                    
                                    if(rx_1_data[3]== 'N')
                                        focus.command = focus.position -1;
                                    else 
                                        focus.command = focus.position +1;
                                    
                                    focus.stop_command = 0; 
                                    focus.move_command = 1;
                                    focus.speed = focus.speed_preset;
                                }
                                
                                else 
                                {
                                    focus.invalid_req_position = 1; 
                                    focus.stop_command = 0; 
                                    
                                    return;
                                }
                                    
                                break;
                            }

