arieselectronicslab/motioncontrollers/schmidt_dspic30f4011_focus.X/schmidt_dspic30f4011_focus.c
                                    if(rx_1_data[4]== 'U')  //User mode
                                    {
                                        focus.expert = 0;
                                        focus.maint_mode = 0;
                                    }
                                    if(rx_1_data[4]== 'X')  //expert mode
                                    {
                                        focus.expert = 1;
                                        focus.maint_mode = 0; 
                                    }
                                    
                                    if(rx_1_data[4]== 'N')  //Engineering mode
                                    {
                                        focus.expert = 0;
                                        focus.maint_mode = 1; 
                                    }
                                    
                                    if(rx_1_data[4]== 'P')  //Director bit
                                    {
                                        focus.clockwise_is_positive = 1; 
                                    }
                                    
                                    if(rx_1_data[4]== 'p')  //Director bit
                                    {
                                        focus.clockwise_is_positive = 0; 
                                    }
                                    
                                    if(rx_1_data[4]== 'H')  //Director bit
                                    {
                                        focus.home_direction = 1; 
                                    }
                                    
                                    if(rx_1_data[4]== 'h')  //Director bit
                                    {
                                        focus.home_direction = 0; 
                                    }
                                    
                                    
                                    if(rx_1_data[4]== 'A')  //Error ack  
                                    {                                         
                                        focus.error_ack = 1; 
                                    }
                                }
                                break;
                            }
            default:
                            focus.bad_rec1_command =1 ;
                            break ;
        }   
    }
    
    
} 


void __attribute__((__interrupt__, __auto_psv__)) _PWMInterrupt(void)
{
    
}